app/controllers/api/events_controller.rb

  def show
    events = Event.all_events(params[:start], params[:end])
    events = events.map do |e|
---
SELECT "events".* FROM "events" WHERE (start >= '2017-07-30' AND start <= '2017-09-10')