app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (user_id = 2)
---
  def preview
    @events = Event.where("user_id = ?", current_user.id)