app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @acces_user
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "repeat" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "weeeeeeeee"], ["repeat", "week"], ["updated_at", "2017-08-10 17:36:23.434057"], ["id", 1]]
---
  def update
    @event = Event.find(params[:id])
    respond_to do |format|
      if @event.update(event_params)

INSERT INTO "events" ("title", "start", "end", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["start", "2017-07-20 14:53:00"], ["end", "2017-08-08 14:53:00"], ["created_at", "2017-08-08 14:54:00.438155"], ["updated_at", "2017-08-08 14:54:00.438155"], ["description", ""]]
---
  def create
    @current_user = current_user.id
    @current_user = {"user_id" => (@current_user)}
    event_params_save = (event_params).merge(@current_user)
    @event = Event.new(event_params_save)
    respond_to do |format|
      if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.delete

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 LIMIT $2  [["user_id", 32], ["LIMIT", 1]]
---
  def my
    @events = Event.where("user_id = ?", current_user.id)